const text = [
    "قَالَ رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي يَفْقَهُوا قَوْلِي {سورة طه}",
    "«سلوا الله علما نافعا، وتعوذوا بالله من علم لا ينفع»",
    "أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوب {سورة الرعد}",
    "«من حسن إسلام المرء، تركه ما لا يعنيه»",
    "إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَاب {سورة الزمر}",
    "«لا يؤمن أحدكم حتىَ يحب لأخيه ما يحب لنفسه»",
    "قَالَ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي فَغَفَرَ لَهُ ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيم {سورة القصص}",
    "«ازهد في الدنيا يحبّك الله ، وازهد فيما عند الناس يحبّك الناس»",
    "وَقُل رَّبِّ زِدْنِي عِلْمًا {سورة طه}",
    "«كن فيِ الدنيا كأنكَّ غريب أو عابر سبيل»",
    "رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ {سورة الشعراء}",
    "«كن فيِ الدنيا كأنكَّ غريب أو عابر سبيل»",
    "وَتَوَكَّلْ عَلَى الْحَيِّ الَّذِي لَا يَمُوتُ وَسَبِّحْ بِحَمْدِهِ ۚ وكَفَىٰ بِهِ بِذُنُوبِ عِبَادِهِ خَبِيرًا {سورة الفرقان}",
    "«من سلك طريقا يبتغي فيه علما سهل الله له طريقا إلى الجنة»",
    "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ {سورة إبراهيم}",
    "أستغفر الله العظيم وأتوب إليه",
    "سبحان الله وبحمده، سبحان الله العظيم",
    "الحمد لله رب العالمين",
    "لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير",
    "أستغفر الله الذي لا إله إلا هو الحي القيوم وأتوب إليه",
    "حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم",
    "اللهم إني أسألك علماً نافعاً، ورزقاً طيباً، وعملاً متقبلاً",
    "اللهم إني أعوذ بك من عذاب القبر ومن عذاب النار",
    "اللهم إني أسألك الجنة وما قرب إليها من قولٍ أو عمل، وأعوذ بك من النار وما قرب إليها من قولٍ أو عمل",
];

function getRandomText() {
    return text[Math.floor(Math.random() * text.length)];
}

const notification = document.getElementById("notification");
const quoteText = document.getElementById("notif-Text");
const closeNotificationButton = document.getElementById("closeNotification");

const randomText = getRandomText();
quoteText.textContent = randomText;

closeNotificationButton.addEventListener("click", () => {
    notification.style.display = "none";
});
